#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/posfiap/pos-fiap/runs/run-tVSdkx3ipS9YFsLK

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_vpc.vpc: Refreshing state... [id=vpc-07e73cff97f426c9a]
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:cluster/app_cluster]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecsExecutionRole]
aws_iam_policy_attachment.ecs_execution_role_attachment: Refreshing state... [id=ecsExecutionRoleAttachment]
aws_ecs_task_definition.td: Refreshing state... [id=app]
aws_subnet.sn3: Refreshing state... [id=subnet-04d747b60cad2763e]
aws_subnet.sn2: Refreshing state... [id=subnet-073857a06395b3be9]
aws_subnet.sn1: Refreshing state... [id=subnet-050f0395dafd207de]
aws_security_group.sg: Refreshing state... [id=sg-010569a0a64ec7592]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service]
aws_subnet.sn3: Drift detected (update)
aws_vpc.vpc: Drift detected (update)
aws_iam_role.ecs_execution_role: Drift detected (update)
aws_ecr_repository.repo: Drift detected (update)
aws_security_group.sg: Drift detected (update)
aws_subnet.sn2: Drift detected (update)
aws_ecs_service.service: Drift detected (update)
aws_iam_policy_attachment.ecs_execution_role_attachment: Drift detected (update)
aws_ecs_task_definition.td: Drift detected (update)
aws_subnet.sn1: Drift detected (update)
aws_ecs_cluster.ecs: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:027260563052:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.td must be replaced
-/+ resource "aws_ecs_task_definition" "td" {
      ~ arn                      = "arn:aws:ecs:us-east-1:027260563052:task-definition/app:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:027260563052:task-definition/app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment  = []
                  ~ image        = "332769750459.dkr.ecr.us-east-1.amazonaws.com/app_repo" -> "027260563052.dkr.ecr.us-east-1.amazonaws.com/app_repo"
                  - mountPoints  = []
                    name         = "app"
                  ~ portMappings = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom  = []
                    # (3 unchanged attributes hidden)
                },
            ]
        )
      ~ id                       = "app" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = "vpc-07e73cff97f426c9a"
    }

  # aws_route_table.rt will be created
  + resource "aws_route_table" "rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-07e73cff97f426c9a"
    }

  # aws_route_table_association.route1 will be created
  + resource "aws_route_table_association" "route1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-050f0395dafd207de"
    }

  # aws_route_table_association.route2 will be created
  + resource "aws_route_table_association" "route2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-073857a06395b3be9"
    }

  # aws_route_table_association.route3 will be created
  + resource "aws_route_table_association" "route3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-04d747b60cad2763e"
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @AlexandreZelante, Action: `pull_request`*